; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v8)
		(pred_5 ?v7)
		(pred_2 ?v3)
		(pred_4 ?v3)
		(pred_1 ?v7 ?v3)
		(pred_3)
		(pred_6 ?v7))

   (:action op_2
       :parameters  (?v2 ?v1)
       :precondition (and (not-eq ?v2 ?v1) 
                          (pred_2 ?v2) (pred_2 ?v1) (pred_4 ?v2))
       :effect (and  (pred_4 ?v1)
		     (not (pred_4 ?v2))))


   (:action op_3
       :parameters (?v4 ?v6)
       :precondition  (and  (pred_5 ?v4) (pred_2 ?v6)
			    (pred_1 ?v4 ?v6) (pred_4 ?v6) (pred_3))
       :effect (and (pred_6 ?v4)
		    (not (pred_1 ?v4 ?v6)) 
		    (not (pred_3))))

   (:action op_1
       :parameters  (?v4  ?v6)
       :precondition  (and  (pred_5 ?v4) (pred_2 ?v6)
			    (pred_6 ?v4) (pred_4 ?v6))
       :effect (and (pred_1 ?v4 ?v6)
		    (pred_3)
		    (not (pred_6 ?v4)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_04 obj_02 obj_05 obj_07 obj_06 obj_03 
          obj_08 obj_01 
)
(:init
(pred_2 obj_04)
(pred_2 obj_02)
(pred_2 obj_05)
(pred_2 obj_07)
(pred_2 obj_06)
(pred_2 obj_03)
(pred_5 obj_08)
(pred_5 obj_01)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_07 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(pred_3)
(pred_1 obj_08 obj_07)
(pred_1 obj_01 obj_05)
(pred_4 obj_07)
)
(:goal
(and
(pred_1 obj_08 obj_03)
(pred_1 obj_01 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_08 obj_03) (pred_4 obj_04))
    (sometime-before  (pred_1 obj_01 obj_06) (pred_4 obj_04))
  )
)
)

; plan
1. (op_2 obj_07 obj_05)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_05)
   goals met: 0 of 2
2. (op_3 obj_01 obj_05)
   deleted: (pred_1 obj_01 obj_05) (pred_3)
   added: (pred_6 obj_01)
   goals met: 0 of 2
3. (op_2 obj_05 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_03)
   goals met: 0 of 2
4. (op_1 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_1 obj_01 obj_03) (pred_3)
   goals met: 0 of 2
5. (op_2 obj_03 obj_07)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_07)
   goals met: 0 of 2
6. (op_3 obj_08 obj_07)
   deleted: (pred_1 obj_08 obj_07) (pred_3)
   added: (pred_6 obj_08)
   goals met: 0 of 2
7. (op_2 obj_07 obj_04)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_04)
   goals met: 0 of 2
8. (op_1 obj_08 obj_04)
   deleted: (pred_6 obj_08)
   added: (pred_1 obj_08 obj_04) (pred_3)
   goals met: 0 of 2
9. (op_2 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_03)
   goals met: 0 of 2
10. (op_3 obj_01 obj_03)
   deleted: (pred_1 obj_01 obj_03) (pred_3)
   added: (pred_6 obj_01)
   goals met: 0 of 2
11. (op_2 obj_03 obj_06)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_06)
   goals met: 0 of 2
12. (op_1 obj_01 obj_06)
   deleted: (pred_6 obj_01)
   added: (pred_1 obj_01 obj_06) (pred_3)
   goals met: 1 of 2
13. (op_2 obj_06 obj_04)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_04)
   goals met: 1 of 2
14. (op_3 obj_08 obj_04)
   deleted: (pred_1 obj_08 obj_04) (pred_3)
   added: (pred_6 obj_08)
   goals met: 1 of 2
15. (op_2 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_03)
   goals met: 1 of 2
16. (op_1 obj_08 obj_03)
   deleted: (pred_6 obj_08)
   added: (pred_1 obj_08 obj_03) (pred_3)
   goals met: 2 of 2
